print ( 'Я проснулся утром и увидел в окне странную тень...' )
print ( '1-Я подошел ближе к окну. 2-Я продолжил спать.' )
choose1 = int ( input ( ) )
if choose1 == 1:
    print ( 'Подойдя к окну я вижу лишь силуэт человека, смотрящего на меня.' )
else:
    print ( 'Проснувшись, я иду к маме и рассказываю об уведенном.' )
if choose1 == 1:
    print ( 'Я пытаюсь разглядеть силуэт, но ничего не получается.' )
else:
    print ( 'Мама успокаевает меня и говорит, что это был лишь сон.' )
if choose1 == 2:
    print ( 'Конец игры' )
if choose1 == 1:
    print ( '1-Я вышел на улицу, чтобы увидеть кто это. 2-Я остался дома и рассказал маме.' )
choose2 = int ( input ( ) )
if choose2 == 2:
    print ( 'Мама успокоила меня и сказала, что это был лишь сон.' )
if choose2 == 2:
    print ( 'Конец игры' )
if choose2 == 1:
    print ( 'Когда я начал одеваться, мама спросила куда я собираюсь?' )
if choose2 == 1:
    print ( '1-Соврать. 2- Рассказать маме о увиденном.' )
choose3 = int ( input ( ) )
if choose3 == 1:
    print ( 'Я сказал маме, что пошел в магазин за хлебом.' )
if choose3 == 2:
    print ( 'Я сказал маме, что увидел в окне силуэт человека, который на тебя смотрел и хочешь узнать кто это.' )
if choose3 == 2:
    print ( 'Конец игры' )
if choose3 == 1:
    print ( 'Выйдя на улицу, я подошел к своему окну, но никого небыло.' )
print ( 'На следующий день я, опять проснувшись утром вижу этот силуэт, но уже намного ближе и подойдя к окну я увидел его лицо...' )
print ( 'После того как я его увидел, я никогда больше не подходил к окну.' )
print ( 'А увидел я там...' )
print ( 'Продолжение следует)))' )
